#10.Вывести на экран числа от 0 до 50, кроме 35
lst = [i for i in range(1,50)]
lst.remove(35)
print(lst)