# 7.Создать список с числами от 1 до 50 используя генератор списков
list_1 = [i for i in range(1,50)]
print(list_1)